In [1]:
# import dependencies
import pandas as pd
from pandas import DataFrame, read_csv

In [2]:
# read file
discouraged_file = "Resources/Characteristics of Discouraged Jobseekers.xls"
discouraged_df = pd.read_excel(discouraged_file, 'Table 8.1')
discouraged_df.head(30)

,Australian Bureau of Statistics,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,"6226.0 Participation, Job Search and Mobility,...",NaN,NaN,NaN,NaN,NaN
1,Released at 11:30 am (Canberra time) Mon 10 Au...,NaN,NaN,NaN,NaN,NaN
2,Table 8.1 Characteristics of discouraged job s...,NaN,NaN,NaN,NaN,NaN
3,NaN,WANTED TO WORK BUT WERE NOT ACTIVELY LOOKING F...,NaN,NaN,NaN,NaN
4,NaN,Discouraged job seekers,Other,Total,Persons with marginal attachment to the labour...,Persons not in the labour force
5,NaN,'000,'000,'000,'000,'000
6,...,NaN,NaN,NaN,NaN,NaN
7,State or territory of usual residence,NaN,NaN,NaN,NaN,NaN
8,New South Wales,35.2944,247.034,282.328,343.451,2224.24
9,Victoria,29.6652,215.187,244.852,318.272,1747.89
10,Queensland,16.5153,142.389,158.904,199.865,1358.46
11,South Australia,5.06429,54.8702,59.9345,75.4966,519.82
12,Western Australia,11.4981,91.9218,103.42,123.355,661.035
13,Tasmania,3.68719,16.2465,19.9337,24.3254,163.908
14,Northern Territory,0.941022,5.99106,6.93209,8.56352,36.7182
15,Australian Capital Territory,1.03062,12.8999,13.9306,17.8594,92.8357
16,Age group (years),NaN,NaN,NaN,NaN,NaN
17,15–24,19.1276,247.326,266.454,326.391,978.675
18,25–34,10.2106,161.35,171.561,230.371,545.509
19,35–44,12.0109,133.147,145.158,192.946,483.355
20,45–54,8.33762,79.0967,87.4344,112.358,477.413
21,55–64,19.2106,81.0895,100.3,121.605,960.123
22,65 and over,34.7988,84.5289,119.328,127.517,3359.83
23,Country of birth,NaN,NaN,NaN,NaN,NaN
24,Born in Australia,63.2401,504.055,567.295,709.086,4400.02
25,Born overseas,40.4562,282.484,322.94,400.961,2400.95
26,Oceania and Antarctica,2.67608,29.1249,31.801,39.423,172.159
27,North-West Europe,6.27017,38.5205,44.7906,53.1013,611.505
28,Southern and Eastern Europe,4.46844,20.5849,25.0534,30.334,401.183
29,North Africa and the Middle East,3.95393,25.1346,29.0886,35.1209,197.114

In [3]:
# drop first 7 rows
discouraged_df.drop(discouraged_df.index[0:8],0,inplace=True)
discouraged_df

,Australian Bureau of Statistics,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
8,New South Wales,35.2944,247.034,282.328,343.451,2224.24
9,Victoria,29.6652,215.187,244.852,318.272,1747.89
10,Queensland,16.5153,142.389,158.904,199.865,1358.46
11,South Australia,5.06429,54.8702,59.9345,75.4966,519.82
12,Western Australia,11.4981,91.9218,103.42,123.355,661.035
...,...,...,...,...,...,...
118,Arrived 20 years or more ago,8.3185,48.8159,57.1344,66.6752,884.3
119,Total,57.5676,498.686,556.253,681.28,3919.27
120,NaN,NaN,NaN,NaN,NaN,NaN
121,NaN,NaN,NaN,NaN,NaN,NaN
122,© Commonwealth of Australia 2020,NaN,NaN,NaN,NaN,NaN

In [4]:
# rename columns
discouraged_df.columns = ['state_territory', 'discouraged_jobseekers', 'Other', 'Total', 'Labour Force', 'Not in Labour Force']
discouraged_df.head(30)

,state_territory,discouraged_jobseekers,Other,Total,Labour Force,Not in Labour Force
8,New South Wales,35.2944,247.034,282.328,343.451,2224.24
9,Victoria,29.6652,215.187,244.852,318.272,1747.89
10,Queensland,16.5153,142.389,158.904,199.865,1358.46
11,South Australia,5.06429,54.8702,59.9345,75.4966,519.82
12,Western Australia,11.4981,91.9218,103.42,123.355,661.035
13,Tasmania,3.68719,16.2465,19.9337,24.3254,163.908
14,Northern Territory,0.941022,5.99106,6.93209,8.56352,36.7182
15,Australian Capital Territory,1.03062,12.8999,13.9306,17.8594,92.8357
16,Age group (years),NaN,NaN,NaN,NaN,NaN
17,15–24,19.1276,247.326,266.454,326.391,978.675
18,25–34,10.2106,161.35,171.561,230.371,545.509
19,35–44,12.0109,133.147,145.158,192.946,483.355
20,45–54,8.33762,79.0967,87.4344,112.358,477.413
21,55–64,19.2106,81.0895,100.3,121.605,960.123
22,65 and over,34.7988,84.5289,119.328,127.517,3359.83
23,Country of birth,NaN,NaN,NaN,NaN,NaN
24,Born in Australia,63.2401,504.055,567.295,709.086,4400.02
25,Born overseas,40.4562,282.484,322.94,400.961,2400.95
26,Oceania and Antarctica,2.67608,29.1249,31.801,39.423,172.159
27,North-West Europe,6.27017,38.5205,44.7906,53.1013,611.505
28,Southern and Eastern Europe,4.46844,20.5849,25.0534,30.334,401.183
29,North Africa and the Middle East,3.95393,25.1346,29.0886,35.1209,197.114
30,South-East Asia,2.92998,42.3832,45.3132,59.2368,291.192
31,North-East Asia,9.10964,49.8073,58.9169,71.7749,322.318
32,Southern and Central Asia,4.2763,50.4814,54.7577,72.3753,228.649
33,Americas,2.01153,11.375,13.3866,16.8602,93.9395
34,Sub-Saharan Africa,4.76009,15.0721,19.8321,22.7342,82.8886
35,Country of birth and elapsed years since arriv...,NaN,NaN,NaN,NaN,NaN
36,Born in Australia,63.2401,504.055,567.295,709.086,4400.02
37,Born overseas,40.4562,282.484,322.94,400.961,2400.95

In [5]:
# convert object values to float
discouraged_full = discouraged_df[['state_territory', 'discouraged_jobseekers']].copy()
discouraged_full[['discouraged_jobseekers']] = discouraged_full[['discouraged_jobseekers']].apply(pd.to_numeric, errors='coerce')
discouraged_full

                      state_territory  discouraged_jobseekers
8                     New South Wales               35.294443
9                            Victoria               29.665225
10                         Queensland               16.515309
11                    South Australia                5.064287
12                  Western Australia               11.498129
..                                ...                     ...
118      Arrived 20 years or more ago                8.318497
119                             Total               57.567586
120                               NaN                     NaN
121                               NaN                     NaN
122  © Commonwealth of Australia 2020                     NaN

[115 rows x 2 columns]

In [6]:
# set values to actual amount
discouraged_full[['discouraged_jobseekers']] = discouraged_full[['discouraged_jobseekers']] * 1000
discouraged_full

                      state_territory  discouraged_jobseekers
8                     New South Wales            35294.443384
9                            Victoria            29665.225257
10                         Queensland            16515.309330
11                    South Australia             5064.287140
12                  Western Australia            11498.128840
..                                ...                     ...
118      Arrived 20 years or more ago             8318.497240
119                             Total            57567.586151
120                               NaN                     NaN
121                               NaN                     NaN
122  © Commonwealth of Australia 2020                     NaN

[115 rows x 2 columns]

In [7]:
# check data types
discouraged_full.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 115 entries, 8 to 122
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   state_territory         113 non-null    object
 1   discouraged_jobseekers  99 non-null     float64
dtypes: float64(1), object(1)
memory usage: 2.2+ KB

In [8]:
# find location table
location_df = discouraged_full[discouraged_full["state_territory"].isin(['New South Wales', 'Victoria', 'Queensland', 'South Australia', 'Western Australia', 'Tasmania', 'Northern Territory', 'Australian Capital Territory'])]
location_df = location_df.copy()
location_df

                 state_territory  discouraged_jobseekers
8                New South Wales            35294.443384
9                       Victoria            29665.225257
10                    Queensland            16515.309330
11               South Australia             5064.287140
12             Western Australia            11498.128840
13                      Tasmania             3687.193909
14            Northern Territory              941.021873
15  Australian Capital Territory             1030.624947
46               New South Wales            15720.363625
47                      Victoria            12941.473265
48                    Queensland             5823.649801
49               South Australia             2686.831138
50             Western Australia             6172.344732
51                      Tasmania             1425.445288
52            Northern Territory              526.559214
53  Australian Capital Territory              831.981467
84               New South Wales            19574.079759
85                      Victoria            16723.751992
86                    Queensland            10691.659529
87               South Australia             2377.456002
88             Western Australia             5325.784108
89                      Tasmania             2261.748621
90            Northern Territory              414.462660
91  Australian Capital Territory              198.643480

In [9]:
# narrow down selection
location_persons = location_df[:8].copy()
location_persons

                 state_territory  discouraged_jobseekers
8                New South Wales            35294.443384
9                       Victoria            29665.225257
10                    Queensland            16515.309330
11               South Australia             5064.287140
12             Western Australia            11498.128840
13                      Tasmania             3687.193909
14            Northern Territory              941.021873
15  Australian Capital Territory             1030.624947

In [10]:
# reset index
location_persons.reset_index(drop=True, inplace=True)
location_persons

                state_territory  discouraged_jobseekers
0               New South Wales            35294.443384
1                      Victoria            29665.225257
2                    Queensland            16515.309330
3               South Australia             5064.287140
4             Western Australia            11498.128840
5                      Tasmania             3687.193909
6            Northern Territory              941.021873
7  Australian Capital Territory             1030.624947

In [18]:
# print table to csv
location_persons.to_csv('discouragedjobseekers_location.csv', index=False)

In [12]:
# find age table
age_df = discouraged_full[discouraged_full["state_territory"].isin(['15–24', '25–34', '35–44', '45–54', '55–64', '65 and over'])]
age_df = age_df.copy()
age_df

   state_territory  discouraged_jobseekers
17           15–24            19127.603453
18           25–34            10210.574674
19           35–44            12010.948635
20           45–54             8337.623604
21           55–64            19210.640148
22     65 and over            34798.844168
55           15–24             9701.105711
56           25–34             3255.898798
57           35–44             2862.987251
58           45–54             2649.042042
59           55–64             7073.985807
60     65 and over            20585.628921
93           15–24             9426.497742
94           25–34             6954.675876
95           35–44             9147.961384
96           45–54             5688.581562
97           55–64            12136.654341
98     65 and over            14213.215247

In [13]:
# narrow down selection
age_persons = age_df[:6].copy()
age_persons

   state_territory  discouraged_jobseekers
17           15–24            19127.603453
18           25–34            10210.574674
19           35–44            12010.948635
20           45–54             8337.623604
21           55–64            19210.640148
22     65 and over            34798.844168

In [14]:
# reset index
age_persons.reset_index(drop=True, inplace=True)
age_persons

  state_territory  discouraged_jobseekers
0           15–24            19127.603453
1           25–34            10210.574674
2           35–44            12010.948635
3           45–54             8337.623604
4           55–64            19210.640148
5     65 and over            34798.844168

In [15]:
# rename first column to match table
age_persons.columns = ['age_range', 'discouraged_jobseekers']
age_persons

     age_range  discouraged_jobseekers
0        15–24            19127.603453
1        25–34            10210.574674
2        35–44            12010.948635
3        45–54             8337.623604
4        55–64            19210.640148
5  65 and over            34798.844168

In [17]:
# print table to csv
age_persons.to_csv('discouragedjobseekers_age.csv', index=False)